In [1]:
import pandas as pd

WAP to demonstrate different ways to create pandas dataframe

In [3]:
# 1 using list

list1 = [1,2,3,4,5]
series1 = pd.Series(list1)
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# 2 using numpy array
import numpy as np
array1 = np.arange(1,6)
series2 = pd.Series(array1)
series2

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [5]:
# 3 using dictionary

dict1 = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
series3 = pd.Series(dict1)
series3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
# 4 using scalar value

series4 = pd.Series(10)
series4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
# 5 series with custom index

list2 = [1, 2, 3, 4 ,5]
index1 = ['a', 'b', 'c', 'd', 'e']
series5 = pd.Series(list2, index=index1)
series5

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
# 6 using tuple 

tuple1 = (1, 2, 3, 4, 5)
series6 = pd.Series(tuple1)
series6

0    1
1    2
2    3
3    4
4    5
dtype: int64

**NOTE:** We can't create pandas series using python set since set in unordered structure

WAP to demonstrate different ways to create pandas dataframe

In [12]:
# 1 empty dataframe

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [14]:
# 2 using list of lists

data = [['tom', 10], ['nick', 12], ['mike', 14]]
df = pd.DataFrame(data)
df

      0   1
0   tom  10
1  nick  12
2  mike  14

In [15]:
# 3 using dictionary of ndArray/list

data1 = {'Name': ['tom', 'nick', 'mike'], 'Age': [10, 12, 14]}
df1 = pd.DataFrame(data1)
df1

   Name  Age
0   tom   10
1  nick   12
2  mike   14

In [18]:
# 4 using list of dictionary

data2 = [{'name': 'tom', 'age': 10}, {'name': 'nick', 'age': 12}, {'name': 'mike', 'age': 14}]
df2 = pd.DataFrame(data2)
df2

   name  age
0   tom   10
1  nick   12
2  mike   14

In [19]:
# 5 using zip() function

name = ['tom', 'nick', 'mike']
age = [10, 12, 14]
# getting list of tuple from the two lists
# merging  them using zip() function

list_of_tuple = list(zip(name, age))

df3 = pd.DataFrame(list_of_tuple)
df3

      0   1
0   tom  10
1  nick  12
2  mike  14

WAP to iterate over rows in a pandas dataframe

In [20]:
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'], 'Age': [21, 19, 20, 18], 
        'Stream': ['Math', 'Commerce', 'Arts', 'Biology'], 'Percentage': [88, 92, 95, 70]}
df = pd.DataFrame(data)
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

In [21]:
# 1 using index attribute

for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [33]:
# 2 using loc() function
# syntax: df.loc[row no., col name]

for i in range(len(df)):
    print(df.loc[i, 'Name'], df.loc[i, 'Age'])

Ankit 21
Amit 19
Aishwarya 20
Priyanka 18

In [34]:
# 3 using iloc() function
# syntax: df.iloc[row no, col no]

for i in range(len(df)): 
    print(df.iloc[i, 0], df.iloc[i, 2])

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [35]:
# 4 using iterrows()

for  index, row in df.iterrows():
    print(row['Name'], row['Age'])

Ankit 21
Amit 19
Aishwarya 20
Priyanka 18

WAP to add a column to the existing dataframe

In [2]:
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'], 'Age': [21, 19, 20, 18], 
        'Stream': ['Math', 'Commerce', 'Arts', 'Biology'], 'Percentage': [88, 92, 95, 70]}
df = pd.DataFrame(data)
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

In [4]:
df['City'] = ['Patna', 'Raipur', 'Bhilai', 'Delhi']
df

        Name  Age    Stream  Percentage    City
0      Ankit   21      Math          88   Patna
1       Amit   19  Commerce          92  Raipur
2  Aishwarya   20      Arts          95  Bhilai
3   Priyanka   18   Biology          70   Delhi

WAP to reshape a series ser into a DataFrame with 7 rows and 5 columns.  
Ser = pd.Series(np.rando,.randint(1,10,35))

In [6]:
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     8
1     6
2     3
3     1
4     7
5     4
6     7
7     3
8     6
9     2
10    6
11    9
12    2
13    4
14    4
15    1
16    7
17    5
18    7
19    5
20    7
21    6
22    1
23    5
24    8
25    9
26    1
27    7
28    8
29    6
30    3
31    6
32    4
33    9
34    2
dtype: int32

In [11]:
reshaped_arr = np.array(ser).reshape(7, 5)
reshaped_arr

array([[8, 6, 3, 1, 7],
       [4, 7, 3, 6, 2],
       [6, 9, 2, 4, 4],
       [1, 7, 5, 7, 5],
       [7, 6, 1, 5, 8],
       [9, 1, 7, 8, 6],
       [3, 6, 4, 9, 2]])

In [12]:
df = pd.DataFrame(reshaped_arr)
df

   0  1  2  3  4
0  8  6  3  1  7
1  4  7  3  6  2
2  6  9  2  4  4
3  1  7  5  7  5
4  7  6  1  5  8
5  9  1  7  8  6
6  3  6  4  9  2

WAP to load a csv file to pandas dataframe with delimiter space

In [17]:
df = pd.read_csv('C:\\Users\\Aditya Mithar\\Desktop\\KP programming\\Python\\Pandas\\Reading&WritingFiles\\mycsv10.csv')
df

   Name    Class RollNo Subject
0  Prakhar 5     23     English
1    Raj     3     12     Maths
2  Ankit   7     45     Science
3    Ritesh  2     67     Hindi

WAP to show the use of loc() and iloc()

loc() and iloc() are the two functions to select rows and columns from a dataframe. 

**loc():** It is used to select rows and columns using labels.

**iloc():** It is used to select rows and columns using indices

In [18]:
df = pd.read_csv('C:\\Users\\Aditya Mithar\\Desktop\\KP programming\\Python\\IISF\\Data2.csv')
df

,State Identifer,FY,Agriculture,Barren land,Buildup(Mining),Buildup(Rural),Buildup(Urban),Forest,Wet lands,GDP_Agric,GDP_Industry,GDP_Service,TotalGDP,Unnamed: 13
0,UP,2005-06,187013.85,687.72,98.53,7001.23,4141.60,12618.51,11362.04,2973694,5460143,13135777,27781788,NaN
1,UP,2011-12,194583.39,7587.55,367.92,8258.82,3921.13,15485.14,10567.19,8726191,9640976,22578126,41840413,NaN
2,UP,2015-16,194498.37,219.60,407.55,8289.32,4101.90,15469.85,10569.58,12645300,9716501,41693882,113780794,NaN
3,AP,2005-06,166112.16,3297.70,740.19,4922.85,2596.83,59550.71,18582.09,3128389,2489325,7126015,14197662,NaN
4,AP,2011-12,95892.25,15585.19,446.52,2926.42,1503.12,34572.64,11965.12,3904992,5091104,11875005,22128548,NaN
5,AP,2015-16,96582.82,2262.90,0.63,411.73,125.91,34043.46,12200.10,5845963,3994701,20507959,49860626,NaN
6,TN,2005-06,88082.68,535.13,229.76,3722.79,2075.40,20405.74,9336.85,2973694,6372872,14290360,24956705,NaN
7,TN,2011-12,88417.12,5320.27,597.95,6137.33,2648.07,187474.78,374949.56,3197598,13244766,26411788,43323803,NaN
8,TN,2015-16,88222.88,337.22,616.14,6137.33,2796.52,17087.15,9663.12,5004574,10666070,46001730,96756246,NaN
9,CG,2005-06,61135.84,567.84,236.47,3100.17,708.95,3196.50,3196.50,832472,1527853,1753948,4940774,NaN
10,CG,2011-12,61871.20,560.84,293.38,3100.17,845.75,60773.31,3346.42,1202919,3635221,3106638,8340937,NaN
11,CG,2015-16,64199.53,690.78,986.44,241.63,3253.68,61782.72,3435.22,1978955,1641223,6423198,19058377,NaN
12,MH,2005-06,210325.33,1113.03,292.45,2982.07,3024.36,56973.37,10030.45,2973694,12227434,27555905,47092933,NaN
13,MH,2011-12,208633.34,21738.67,394.59,3407.32,4272.82,58117.55,11125.72,5163326,22800246,48354198,77560965,NaN
14,MH,2015-16,207409.44,1551.70,363.67,3387.85,4162.99,56906.16,10625.06,9142618,8847319,80220792,165428361,NaN
15,GJ,2005-06,124758.89,204.36,114.02,1497.67,1700.47,12678.04,17781.76,3398200,6884200,10026300,23377600,`
16,GJ,2011-12,121155.82,23051.10,267.44,2527.34,2655.02,14842.22,9670.36,4481060,15745767,18322143,39205778,NaN
17,GJ,2015-16,121626.76,22126.80,277.51,2546.29,2751.91,13173.13,13365.14,7789790,5122121,28222253,89446534,NaN

In [20]:
df.loc[16]

State Identifer           GJ
FY                   2011-12
Agriculture        121155.82
Barren land          23051.1
Buildup(Mining)       267.44
Buildup(Rural)       2527.34
Buildup(Urban)       2655.02
Forest              14842.22
Wet lands            9670.36
GDP_Agric            4481060
GDP_Industry        15745767
GDP_Service         18322143
TotalGDP            39205778
Unnamed: 13              NaN
Name: 16, dtype: object

In [21]:
df.loc[16, 'Forest']

14842.22

In [22]:
df.loc[2:15, 'State Identifer']

2     UP
3     AP
4     AP
5     AP
6     TN
7     TN
8     TN
9     CG
10    CG
11    CG
12    MH
13    MH
14    MH
15    GJ
Name: State Identifer, dtype: object

In [23]:
df.iloc[12]

State Identifer           MH
FY                   2005-06
Agriculture        210325.33
Barren land          1113.03
Buildup(Mining)       292.45
Buildup(Rural)       2982.07
Buildup(Urban)       3024.36
Forest              56973.37
Wet lands           10030.45
GDP_Agric            2973694
GDP_Industry        12227434
GDP_Service         27555905
TotalGDP            47092933
Unnamed: 13              NaN
Name: 12, dtype: object

In [24]:
df.iloc[12, 0]

'MH'

In [25]:
df.iloc[2:13, 0]

2     UP
3     AP
4     AP
5     AP
6     TN
7     TN
8     TN
9     CG
10    CG
11    CG
12    MH
Name: State Identifer, dtype: object

In [26]:
df.iloc[2:12, 0:8]

,State Identifer,FY,Agriculture,Barren land,Buildup(Mining),Buildup(Rural),Buildup(Urban),Forest
2,UP,2015-16,194498.37,219.60,407.55,8289.32,4101.90,15469.85
3,AP,2005-06,166112.16,3297.70,740.19,4922.85,2596.83,59550.71
4,AP,2011-12,95892.25,15585.19,446.52,2926.42,1503.12,34572.64
5,AP,2015-16,96582.82,2262.90,0.63,411.73,125.91,34043.46
6,TN,2005-06,88082.68,535.13,229.76,3722.79,2075.40,20405.74
7,TN,2011-12,88417.12,5320.27,597.95,6137.33,2648.07,187474.78
8,TN,2015-16,88222.88,337.22,616.14,6137.33,2796.52,17087.15
9,CG,2005-06,61135.84,567.84,236.47,3100.17,708.95,3196.50
10,CG,2011-12,61871.20,560.84,293.38,3100.17,845.75,60773.31
11,CG,2015-16,64199.53,690.78,986.44,241.63,3253.68,61782.72